Revit 2027 API
ParameterTypeId.LoadIsConstrainedOnHost Property
 "Is constrained on host"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId LoadIsConstrainedOnHost { get; }
Public Shared ReadOnly Property LoadIsConstrainedOnHost As ForgeTypeId
	Get
public:
static property ForgeTypeId^ LoadIsConstrainedOnHost {
	ForgeTypeId^ get ();
}
static member LoadIsConstrainedOnHost : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace